Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.ImportShapeItemsFromGeometryFiles Method
 Imports shape geometry items from geometry files in specified folder. Import supports following file formats: ".skp", ".dxf", ".dwg", ".step", ".iges", ".stp", ".igs", ".ifc", ".dgn", ".trb" File name is used as shape name. Import throws exception if model is not open. Import overrides the existing shape items in the catalog without any warnings.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ImportShapeItemsFromGeometryFiles(
	string path
)
Public Function ImportShapeItemsFromGeometryFiles (
	path As String
) As Boolean
Parameters
path
Type: System.String
The path to be used for import.
Return Value
Type: Boolean
true if successful.
Examples
using System;
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           if (new CatalogHandler().ImportShapeItemsFromGeometryFiles(System.IO.Path.GetTempPath()))
               Console.WriteLine("Shape geometries imported successfully to model.");
       }
}
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace